---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.Dispose
source: html/249262d0-4568-c478-18ae-0f87c2891b52.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.Dispose Method

Releases all resources used by the StructuralSection

## Syntax (C#)
```csharp
public void Dispose()
```